//
//  ReadmeRu.swift
//  Slider-Player
//
//  Created by Алексей Езерский on 24.06.2025.
//

extension String {
    static let readmeRu = //Russian
"""
Данное приложение разработано в учебных целях. Начало разработки — март 2023 года. 
Полезные коды и приемы могут быть использованы для разработки других приложений. 
                
В Приложении использованы коды, заимствованные из различных источников, форумов программистов, учебных пособий.
                
Внесены необходимые изменения в оригинальные коды для построения целостного Приложения.
                
Предназначено для iOS устройств с версиями выше 16.6. Имеются отдельные примеры с кодами выше 17.0 и 18.0 версий.

Используется только бесплатная стандартная библиотека Фрэймворков для XCode (Foundation, SwiftUI, PhotosUI, MapKit, CoreLocation, AVKit, AVFoundation, Speech, Media, MediaPlayer, CoreImage, SwiftData, Combine, WebKit и др. ). 

Использованы также бесплатные  Web API ресурсы, такие как:
iTunes.com, earthquake.usgs.gov, open-elevation.com, openweathermap.org, weatherapi.com, newsapi.org.

Хранение данных осуществляется в файловой системе iOS стандартными методами. 

Языки: Английский (с ограничениями), Русский. 
                
Краткое описание функционала.
                
Титульный (начальный) экран с выбором:
    Настройки профиля и Приложения.
    Выбор языка (локализация).
    Вход в Основное меню Приложения.  
    Вход в приложение Новые Карты. Работают в связке с объектами из "Альбома". Поиск, прокладка маршрута, панорамные виды, погода. **
    Авторизация с паролем.

Основное меню:

Звуки
    Выбор предустановленных в библиотеке ресурсов  пьес. Плееры 1 и 2. 
    Поиск треков (30с каждый) в iTunes.com, системный Плеер 3. 
    Список музыкальных треков. Управление файлами. Плеер 4. 
    Аудиорекордер. Управление записями. Плеер 4. 
    Пиано кравиатуры с возможностью записи.
    Распознаватель речи с синхронным выводом текста на экран. 

Альбом
    Выбор фото и видео из системного Фотоальбома. 
    Просмотр фото и видео из списка, съемка, редактирование метаданных. *** 
    Карта с поиском и прокладкой маршрута. 
    Погода в месте съемки. ***

Новости
    Экран 1 с Главными и Всеми новостями. Поиск по категориям и темам. 
    Экран 2 с деталями.

Землетрясения
    Актуальные данные из интернета с Геокартами и показ погоды в этом месте. ***

Ещё (полезные примеры кодов)
    Переход на стартовый экран с настройками. 
    Погода* с поиском места (город, код, координаты). **
    Текущая геопозиция. 
    Карта с поиском и прокладкой маршрута (доступно для всех устройств).
    Интернет запрос на основе QR кода.
    QR код генератор -> интернет запрос.
    QR код сканер -> интернет запрос.
    Пример организации Фотогалереи от Apple.
    Уровнемер.
    Переключение системной схемы День/ночь с анимацией.
    Эксперименты с жестами. 
    Сохранение сцен.
    Навигационные примеры переходов.
    Управление рецептами               
                                    
* Функционал применяется также во всех Картах с отображением местного времени. 
** Пункт меню работает только на 17.0+ устройствах.
*** С информацией о широте, долготе, высоте места.
"""
}
